<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input_4" type="Parameter" version="opset1">
			<data shape="?,?,?,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input_4">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_174" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model_3/conv2d_153/BiasAdd__6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_153/BiasAdd__6:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model_3/conv2d_153/Conv2D/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="32" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model_3/conv2d_153/Conv2D/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_153/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model_3/conv2d_153/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_187_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1760" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_187" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model_3/conv2d_153/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_153/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_3/conv2d_153/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_153/Relu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model_3/conv2d_154/Conv2D/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 32, 3, 3" offset="1824" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_3/conv2d_154/Conv2D/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_154/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_3/conv2d_154/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_977_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="6432" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_977" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model_3/conv2d_154/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_154/BiasAdd:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_3/conv2d_154/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_154/Relu:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_3/conv2d_155/Conv2D/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 8, 5, 5" offset="6448" size="3200" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model_3/conv2d_155/Conv2D/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_155/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_3/conv2d_155/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_993_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="9648" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_993" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_3/conv2d_155/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_155/BiasAdd:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model_3/conv2d_155/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_155/Relu:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model_3/conv2d_156/Conv2D/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 8, 5, 5" offset="9664" size="6400" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model_3/conv2d_156/Conv2D/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_156/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model_3/conv2d_156/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_1009_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="16064" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_1009" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model_3/conv2d_156/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_156/BiasAdd:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model_3/conv2d_156/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_156/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model_3/conv2d_157/Conv2D/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 5, 5" offset="16096" size="25600" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model_3/conv2d_157/Conv2D/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_157/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model_3/conv2d_157/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_1025_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="41696" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_1025" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model_3/conv2d_157/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_157/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model_3/conv2d_157/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_157/Relu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/conv2d_transpose/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 5, 5" offset="41760" size="25600" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/conv2d_transpose/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/conv2d_transpose/ReadVariableOp:0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ConvolutionBackpropData_1030" type="ConvolutionBackpropData" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" output_padding="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_1032_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="67360" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_1032" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/BiasAdd:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_101664" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="67392" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_101663" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="67424" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Shape__2726" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__2726:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Const__2936" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="67440" size="16" />
			<output>
				<port id="0" precision="I32" names="Const__2936">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_1056" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="49" name="Gather__2729" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Shape__2106:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="const_starts__622" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64" names="const_starts__622">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="const_ends__373" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67472" size="8" />
			<output>
				<port id="0" precision="I64" names="const_ends__373">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Broadcast_1067" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Slice__2111" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__2111:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Shape__2708" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__2708:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_1072" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="Gather__2713" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/Shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/Shape__2080" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/Shape__2080:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="const_axes__584" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67456" size="8" />
			<output>
				<port id="0" precision="I64" names="const_axes__584">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Broadcast_1097" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Broadcast_1087" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_1__2089" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_1__2089:0" />
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model_3/conv2d_transpose_95/add_1/y:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="67480" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_95/add_1/y:0" />
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/add:0" />
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Unsqueeze__2099" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Unsqueeze__2099:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="const_ends__2245" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67484" size="8" />
			<output>
				<port id="0" precision="I64" names="const_ends__2245">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Broadcast_1077" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_2__2084" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/strided_slice_2__2084:0" />
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/add_1:0" />
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Unsqueeze__2101" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Unsqueeze__2101:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="const_fold_opt__3100" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="67492" size="4" />
			<output>
				<port id="0" precision="I32" names="const_fold_opt__3100">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Concat__2104" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/stack_Concat__2104:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Cast__2105" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Cast__2105:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Broadcast_1598" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Slice__2119" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__2119:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Sub__2124" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Sub__2124:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Div__2127" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Div__2127:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Broadcast_1060" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Slice__2115" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__2115:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Broadcast_1589" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Slice__2123" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__2123:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Sub__2125" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Sub__2125:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Div__2128" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Div__2128:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat__2131" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Concat__2131:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_101662" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="67496" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="ScatterUpdate_101665" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_101666" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="67392" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add__2129" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Add__2129:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Add__2130" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Add__2130:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Concat__2132" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="Concat__2132:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="ScatterUpdate_101667" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_101670" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="67500" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice__2134" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0, 0" end_mask="1, 1, 0, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="Slice__2134:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model_3/conv2d_transpose_90/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_transpose_90/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/conv2d_transpose/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 8, 5, 5" offset="67532" size="6400" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/conv2d_transpose/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_transpose_91/conv2d_transpose/ReadVariableOp:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="ConvolutionBackpropData_10126" type="ConvolutionBackpropData" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" output_padding="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_10128_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="73932" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_10128" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_3/conv2d_transpose_91/BiasAdd:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_102465" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="67392" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_102464" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="67424" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Shape__2858" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__2858:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_10133" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="107" name="Gather__2861" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Shape__2168:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Broadcast_10144" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Slice__2173" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="Slice__2173:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Shape__3012" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__3012:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_10150" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="Gather__3017" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/model_3/conv2d_transpose_91/Shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/Shape__2142" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_91/Shape__2142:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Broadcast_10175" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/model_3/conv2d_transpose_91/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Broadcast_10165" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="StatefulPartitionedCall/model_3/conv2d_transpose_91/strided_slice_1" type="StridedSlice" version="opset1">
